---
kind: property
id: P:Autodesk.Revit.UI.RibbonButton.Image
source: html/34d5d65e-d835-74ec-7c67-22b3b1c684f5.htm
---
# Autodesk.Revit.UI.RibbonButton.Image Property

The image of the button.

## Syntax (C#)
```csharp
public ImageSource Image { get; set; }
```

## Remarks
The image will be shown on the button if it is a part of a stacked set or if it is promoted to the
Quick Access Toolbar. The image should be 16 x 16 pixels. If the image is larger it will NOT be adjusted to fit the
button.